<?php defined('ROOT_DIR') or exit('Nothing');?><div class="main">
    <div class="progress"><ul class="p-1"><li><span>许可协议</span></li><li><span>环境检测</span></li><li><span>设定配置</span></li><li><span>安装完成</span></li></ul></div>
    <div class="text">
        <h1>软件许可协议（软件著作权登记号：2022SR0502416）</h1>
        <h3>尊敬的用户：</h3>
        <p>感谢您选择使用VEITOOL快捷开发框架系统（以下简称“本系统”），希望我们的努力能为您提供一款适用于企业级快速便捷开发的利器，本系统官网为： <a href="https://www.veitool.com" target="_blank">https://www.veitool.com</a>，设有问答社区和相关使用文档。
        使用者无论个人或组织、盈利与否、用途如何（包括以学习和研究为目的），均需仔细阅读本协议，在理解、同意、并遵守本协议的全部条款后，方可开始使用本系统。本授权协议适用且仅适用于本产品，Veitool官方拥有对本授权协议的最终解释权。</p>
        <h3>一. 协议许可的权利</h3>
        <p>您可以在完全遵守本最终用户授权协议的基础上，安装和使用本系统提供的全部功能，而不必支付软件版权授权费用。</p>
        <p>您可以在协议规定的约束和限制范围内修改本系统源代码或界面风格以适应您的使用要求，但需保留本系统的<b>版权信息</b>和<b>链接</b>。</p>
        <p>您拥有使用本系统构建的应用中全部资料、内容及相关信息的所有权，并独立承担相关法律义务。</p>
        <h3>二. 协议规定的约束和限制</h3>
        <p>未经我们书面许可，您不得删除或修改本系统页面中的版权信息及相应的官方链接（无论用途如何、是否经过修改或美化、修改程度如何）。</p>
        <p>您不得在本系统的整体或任何部分基础上以发展任何派生版本、修改版本或第三方版本用于重新分发。</p>
        <p>您不得通过分解软件，把不同功能或把软件的不同部分嵌入到其他软件系统。</p>
        <p>如果您未能遵守本协议的条款，您的授权将被终止，所被许可的权利将被收回，并承担相应法律责任。</p>
        <h3>三. 有限担保和免责声明</h3>
        <p>本系统及所附带的文件是作为不提供任何明确的或隐含的赔偿或担保的形式提供的。用户出于自愿而使用本系统，您必须了解使用本系统的风险，在尚未购买产品技术服务之前，我们不承诺提供任何形式的技术支持、使用担保，也不承担任何因使用本系统而产生问题的相关责任。Veitool官方不对使用本系统构建的网站和应用中的内容或信息承担责任。</p>
        <p>本系统受著作权法、国际著作权条约和其他的知识产权法律或国际条约保护。根据本协议，在此仅许可您非独占性的、非排他性的一般许可使用该软件的权利，而不是出售或转让。</p>
        <p>有关本系统最终用户授权协议、商业授权与技术服务的详细内容，均由Veitool官方网站独家提供。Veitool官方拥有在不事先通知的情况下，修改授权协议和服务价目表的权力，修改后的协议对自改变之日起的新授权用户生效。</p>
        <p>电子文本形式的授权协议如同双方书面签署的协议一样，具有完全的和等同的法律效力。您一旦开始安装本系统，即被视为完全理解并接受本协议的各项条款，在享有上述条款授予的权力的同时，受到相关的约束和限制。协议许可范围以外的行为，将直接违反本授权协议并构成侵权，我们有权随时终止授权，责令停止损害，并保留追究相关责任的权力。</p>
    </div>
</div>
<div class="footer">
    <span class="copyright"><?php echo $copyright;?></span> 
    <span class="formBtn"> <a href="javascript:void(0);" class="layui-btn layui-btn-primary">不同意</a> <a href="?s=2" class="layui-btn">同　意</a></span>
</div>